# Pandas

One dimensional ndarray with axis labels

#### Installation

In [ ]:
! pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

#### Import the library

In [2]:
import pandas as pd
import numpy as np

#### Convert a list to Series

In [ ]:
my_pets = ['Lion','Cat','Birds','Fish']
pd.Series(my_pets)

0     Lion
1      Cat
2    Birds
3     Fish
dtype: object

#### Add index to series

* Length of index list should be equal to length of values in series

In [ ]:
my_days = ['Monday','Tuesday','Wednesday','Thursday','Friday']
my_courses = ['Economics','Geography','Finance','Mathametics','History']
pd.Series(my_courses,index=my_days)

Monday         Economics
Tuesday        Geography
Wednesday        Finance
Thursday     Mathametics
Friday           History
dtype: object

In [ ]:
days = pd.Series(my_days,index="Day1 Day2 Day3 Day4 Day5".split())
courses = pd.Series(my_courses,index="Day1 Day2 Day3 Day4 Day5".split())

In [ ]:
courses['Day5']

'History'

In [ ]:
days + ':' + courses

Day1        Monday:Economics
Day2       Tuesday:Geography
Day3       Wednesday:Finance
Day4    Thursday:Mathametics
Day5          Friday:History
dtype: object

#### Series From Dictionary

In [ ]:
sports ={'Football':'Spain','NBA':'USA','Cricket':'India'}
sports_series = pd.Series(sports)
sports_series

Football    Spain
NBA           USA
Cricket     India
dtype: object

#### Find value at location by index label

In [ ]:
sports_series.loc['Cricket']

'India'

#### Find Value at location by index number

In [ ]:
sports_series.iloc[2]

'India'

#### DataFrame

Two-Dimensional, size-mutable, potentially heterogenous tabular data

#### Create a dataframe from random numbers array

In [ ]:
my_dataframe = pd.DataFrame(np.random.randn(10,5),index='row1 row2 row3 row4 row5 row6 row7 row8 row9 row10'.split(),columns='column1 column2 column3 column4 column5'.split())
my_dataframe

        column1   column2   column3   column4   column5
row1   0.259403 -0.265134  0.842621  0.496901 -0.318720
row2  -0.069150  1.052855  0.022297 -0.278077  1.508068
row3   0.235888  0.754110 -0.924630  1.232044 -0.676358
row4   1.861040  2.096983 -0.434278 -0.952901  0.156523
row5   1.074371  1.519851 -0.180737  0.736275  0.946820
row6  -1.738970 -0.077124 -0.420046 -0.603975  0.271219
row7   0.085268  0.707791  0.810960 -0.457449  0.643091
row8  -0.091393 -0.403601  0.425256  0.542969 -0.571685
row9   0.491791 -0.055839 -0.469492  0.099566  0.050785
row10  0.782362  1.023119 -0.559921  0.189750 -0.508684

#### Selecting a single column

In [ ]:
my_dataframe['column1']

row1     0.259403
row2    -0.069150
row3     0.235888
row4     1.861040
row5     1.074371
row6    -1.738970
row7     0.085268
row8    -0.091393
row9     0.491791
row10    0.782362
Name: column1, dtype: float64

#### Add a new column

In [ ]:
my_dataframe['column6']=my_dataframe['column1']*2
my_dataframe

        column1   column2   column3   column4   column5   column6
row1   0.259403 -0.265134  0.842621  0.496901 -0.318720  0.518806
row2  -0.069150  1.052855  0.022297 -0.278077  1.508068 -0.138300
row3   0.235888  0.754110 -0.924630  1.232044 -0.676358  0.471775
row4   1.861040  2.096983 -0.434278 -0.952901  0.156523  3.722079
row5   1.074371  1.519851 -0.180737  0.736275  0.946820  2.148742
row6  -1.738970 -0.077124 -0.420046 -0.603975  0.271219 -3.477940
row7   0.085268  0.707791  0.810960 -0.457449  0.643091  0.170535
row8  -0.091393 -0.403601  0.425256  0.542969 -0.571685 -0.182786
row9   0.491791 -0.055839 -0.469492  0.099566  0.050785  0.983583
row10  0.782362  1.023119 -0.559921  0.189750 -0.508684  1.564724

#### Drop a column

In [ ]:
my_dataframe.drop('column4',axis=1)

        column1   column2   column3   column5   column6
row1   0.259403 -0.265134  0.842621 -0.318720  0.518806
row2  -0.069150  1.052855  0.022297  1.508068 -0.138300
row3   0.235888  0.754110 -0.924630 -0.676358  0.471775
row4   1.861040  2.096983 -0.434278  0.156523  3.722079
row5   1.074371  1.519851 -0.180737  0.946820  2.148742
row6  -1.738970 -0.077124 -0.420046  0.271219 -3.477940
row7   0.085268  0.707791  0.810960  0.643091  0.170535
row8  -0.091393 -0.403601  0.425256 -0.571685 -0.182786
row9   0.491791 -0.055839 -0.469492  0.050785  0.983583
row10  0.782362  1.023119 -0.559921 -0.508684  1.564724

In [ ]:
my_dataframe

        column1   column2   column3   column4   column5   column6
row1   0.259403 -0.265134  0.842621  0.496901 -0.318720  0.518806
row2  -0.069150  1.052855  0.022297 -0.278077  1.508068 -0.138300
row3   0.235888  0.754110 -0.924630  1.232044 -0.676358  0.471775
row4   1.861040  2.096983 -0.434278 -0.952901  0.156523  3.722079
row5   1.074371  1.519851 -0.180737  0.736275  0.946820  2.148742
row6  -1.738970 -0.077124 -0.420046 -0.603975  0.271219 -3.477940
row7   0.085268  0.707791  0.810960 -0.457449  0.643091  0.170535
row8  -0.091393 -0.403601  0.425256  0.542969 -0.571685 -0.182786
row9   0.491791 -0.055839 -0.469492  0.099566  0.050785  0.983583
row10  0.782362  1.023119 -0.559921  0.189750 -0.508684  1.564724

#### Drop from orignal data

In [ ]:
my_dataframe.drop('column4',axis=1,inplace=True)
my_dataframe

        column1   column2   column3   column5   column6
row1   0.259403 -0.265134  0.842621 -0.318720  0.518806
row2  -0.069150  1.052855  0.022297  1.508068 -0.138300
row3   0.235888  0.754110 -0.924630 -0.676358  0.471775
row4   1.861040  2.096983 -0.434278  0.156523  3.722079
row5   1.074371  1.519851 -0.180737  0.946820  2.148742
row6  -1.738970 -0.077124 -0.420046  0.271219 -3.477940
row7   0.085268  0.707791  0.810960  0.643091  0.170535
row8  -0.091393 -0.403601  0.425256 -0.571685 -0.182786
row9   0.491791 -0.055839 -0.469492  0.050785  0.983583
row10  0.782362  1.023119 -0.559921 -0.508684  1.564724

#### Use index to access row

In [ ]:
my_dataframe.iloc[1]

column1   -0.069150
column2    1.052855
column3    0.022297
column5    1.508068
column6   -0.138300
Name: row2, dtype: float64

#### Fnd a value using row and column index

In [ ]:
my_dataframe.loc['row7','column2']

0.7077908214939704

In [ ]:
my_dataframe.index

Index(['row1', 'row2', 'row3', 'row4', 'row5', 'row6', 'row7', 'row8', 'row9',
       'row10'],
      dtype='object')

#### Add Series to DataFrame

In [ ]:
my_dataframe['spin']=['sp1','sp2','sp3','sp4','sp5','sp6','sp7','sp8','sp9','sp10']
my_dataframe

        column1   column2   column3   column5   column6  spin
row1   0.259403 -0.265134  0.842621 -0.318720  0.518806   sp1
row2  -0.069150  1.052855  0.022297  1.508068 -0.138300   sp2
row3   0.235888  0.754110 -0.924630 -0.676358  0.471775   sp3
row4   1.861040  2.096983 -0.434278  0.156523  3.722079   sp4
row5   1.074371  1.519851 -0.180737  0.946820  2.148742   sp5
row6  -1.738970 -0.077124 -0.420046  0.271219 -3.477940   sp6
row7   0.085268  0.707791  0.810960  0.643091  0.170535   sp7
row8  -0.091393 -0.403601  0.425256 -0.571685 -0.182786   sp8
row9   0.491791 -0.055839 -0.469492  0.050785  0.983583   sp9
row10  0.782362  1.023119 -0.559921 -0.508684  1.564724  sp10

#### Rename the columns

In [ ]:

my_dataframe.rename(columns={
    'column1':'first',
    'column2':'second',
    'column3':'third',
    'column5':'fifth',
    'column6':'sixth',
    },inplace=True)
my_dataframe

          first    second     third     fifth     sixth  spin
row1   0.259403 -0.265134  0.842621 -0.318720  0.518806   sp1
row2  -0.069150  1.052855  0.022297  1.508068 -0.138300   sp2
row3   0.235888  0.754110 -0.924630 -0.676358  0.471775   sp3
row4   1.861040  2.096983 -0.434278  0.156523  3.722079   sp4
row5   1.074371  1.519851 -0.180737  0.946820  2.148742   sp5
row6  -1.738970 -0.077124 -0.420046  0.271219 -3.477940   sp6
row7   0.085268  0.707791  0.810960  0.643091  0.170535   sp7
row8  -0.091393 -0.403601  0.425256 -0.571685 -0.182786   sp8
row9   0.491791 -0.055839 -0.469492  0.050785  0.983583   sp9
row10  0.782362  1.023119 -0.559921 -0.508684  1.564724  sp10

#### Read a csv file

In [ ]:
data = pd.read_csv('Automobile.csv')
data

     symboling  normalized_losses         make  ... city_mpg highway_mpg  price
0            3                168  alfa-romero  ...       21          27  13495
1            3                168  alfa-romero  ...       21          27  16500
2            1                168  alfa-romero  ...       19          26  16500
3            2                164         audi  ...       24          30  13950
4            2                164         audi  ...       18          22  17450
..         ...                ...          ...  ...      ...         ...    ...
196         -1                 95        volvo  ...       23          28  16845
197         -1                 95        volvo  ...       19          25  19045
198         -1                 95        volvo  ...       18          23  21485
199         -1                 95        volvo  ...       26          27  22470
200         -1                 95        volvo  ...       19          25  22625

[201 rows x 26 columns]

#### Description of data inside DataFrame

In [ ]:
data.describe()

        symboling  normalized_losses  ...  highway_mpg         price
count  201.000000         201.000000  ...   201.000000    201.000000
mean     0.840796         125.189055  ...    30.686567  13207.129353
std      1.254802          33.572966  ...     6.815150   7947.066342
min     -2.000000          65.000000  ...    16.000000   5118.000000
25%      0.000000         101.000000  ...    25.000000   7775.000000
50%      1.000000         122.000000  ...    30.000000  10295.000000
75%      2.000000         150.000000  ...    34.000000  16500.000000
max      3.000000         256.000000  ...    54.000000  45400.000000

[8 rows x 16 columns]

#### Information on DataFrame

provides inferred data types

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 201 entries, 0 to 200
Data columns (total 26 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   symboling            201 non-null    int64
 1   normalized_losses    201 non-null    int64
 2   make                 201 non-null    object
 3   fuel_type            201 non-null    object
 4   aspiration           201 non-null    object
 5   number_of_doors      201 non-null    object
 6   body_style           201 non-null    object
 7   drive_wheels         201 non-null    object
 8   engine_location      201 non-null    object
 9   wheel_base           201 non-null    float64
 10  length               201 non-null    float64
 11  width                201 non-null    float64
 12  height               201 non-null    float64
 13  curb_weight          201 non-null    int64
 14  engine_type          201 non-null    object
 15  number_of_cylinders  201 non-null    object
 16  engine_size          201 non-null    int64
 17  fuel_system          201 non-null    object
 18  bore                 201 non-null    float64
 19  stroke               201 non-null    float64
 20  compression_ratio    201 non-null    float64
 21  horsepower           201 non-null    int64
 22  peak_rpm             201 non-null    int64
 23  city_mpg             201 non-null    int64
 24  highway_mpg          201 non-null    int64
 25  price                201 non-null    int64
dtypes: float64(7), int64(9), object(10)
memory usage: 41.0+ KB

#### Selecting a column

In [ ]:
data['make']

0      alfa-romero
1      alfa-romero
2      alfa-romero
3             audi
4             audi
          ...
196          volvo
197          volvo
198          volvo
199          volvo
200          volvo
Name: make, Length: 201, dtype: object

#### Indexes on dataset

In [ ]:
data.index

RangeIndex(start=0, stop=201, step=1)

#### Find Null Values

In [ ]:
data.isnull()

     symboling  normalized_losses   make  ...  city_mpg  highway_mpg  price
0        False              False  False  ...     False        False  False
1        False              False  False  ...     False        False  False
2        False              False  False  ...     False        False  False
3        False              False  False  ...     False        False  False
4        False              False  False  ...     False        False  False
..         ...                ...    ...  ...       ...          ...    ...
196      False              False  False  ...     False        False  False
197      False              False  False  ...     False        False  False
198      False              False  False  ...     False        False  False
199      False              False  False  ...     False        False  False
200      False              False  False  ...     False        False  False

[201 rows x 26 columns]

In [ ]:
data.isnull().sum()

symboling              0
normalized_losses      0
make                   0
fuel_type              0
aspiration             0
number_of_doors        0
body_style             0
drive_wheels           0
engine_location        0
wheel_base             0
length                 0
width                  0
height                 0
curb_weight            0
engine_type            0
number_of_cylinders    0
engine_size            0
fuel_system            0
bore                   0
stroke                 0
compression_ratio      0
horsepower             0
peak_rpm               0
city_mpg               0
highway_mpg            0
price                  0
dtype: int64

#### Find the percentile (quartile) values for DataFrame

In [ ]:
data.describe().T

                   count          mean  ...       75%       max
symboling          201.0      0.840796  ...      2.00      3.00
normalized_losses  201.0    125.189055  ...    150.00    256.00
wheel_base         201.0     98.797015  ...    102.40    120.90
length             201.0    174.200995  ...    183.50    208.10
width              201.0     65.889055  ...     66.60     72.00
height             201.0     53.766667  ...     55.50     59.80
curb_weight        201.0   2555.666667  ...   2926.00   4066.00
engine_size        201.0    126.875622  ...    141.00    326.00
bore               201.0      3.329701  ...      3.58      3.94
stroke             201.0      3.261741  ...      3.46      4.17
compression_ratio  201.0     10.164279  ...      9.40     23.00
horsepower         201.0    103.263682  ...    116.00    262.00
peak_rpm           201.0   5121.393035  ...   5500.00   6600.00
city_mpg           201.0     25.179104  ...     30.00     49.00
highway_mpg        201.0     30.686567  ...     34.00     54.00
price              201.0  13207.129353  ...  16500.00  45400.00

[16 rows x 8 columns]

#### Conditional Query and display selectd columns

In [ ]:
data[data['price']>20000][['make','price']]

              make  price
8             audi  23875
11             bmw  20970
12             bmw  21105
13             bmw  24565
14             bmw  30760
15             bmw  41315
16             bmw  36880
44          jaguar  32250
45          jaguar  35550
46          jaguar  36000
64   mercedes-benz  25552
65   mercedes-benz  28248
66   mercedes-benz  28176
67   mercedes-benz  31600
68   mercedes-benz  34184
69   mercedes-benz  35056
70   mercedes-benz  40960
71   mercedes-benz  45400
122        porsche  22018
123        porsche  32528
124        porsche  34028
125        porsche  37028
198          volvo  21485
199          volvo  22470
200          volvo  22625

#### Multiple coditions for filtering

In [ ]:
data[(data['make']=='volvo')&(data['price']<50000)]

     symboling  normalized_losses   make  ... city_mpg highway_mpg  price
190         -2                103  volvo  ...       23          28  12940
191         -1                 74  volvo  ...       23          28  13415
192         -2                103  volvo  ...       24          28  15985
193         -1                 74  volvo  ...       24          28  16515
194         -2                103  volvo  ...       17          22  18420
195         -1                 74  volvo  ...       17          22  18950
196         -1                 95  volvo  ...       23          28  16845
197         -1                 95  volvo  ...       19          25  19045
198         -1                 95  volvo  ...       18          23  21485
199         -1                 95  volvo  ...       26          27  22470
200         -1                 95  volvo  ...       19          25  22625

[11 rows x 26 columns]

In [ ]:
data[(data['make']=='volvo')&(data['price']<50000)][['make','price']]

      make  price
190  volvo  12940
191  volvo  13415
192  volvo  15985
193  volvo  16515
194  volvo  18420
195  volvo  18950
196  volvo  16845
197  volvo  19045
198  volvo  21485
199  volvo  22470
200  volvo  22625

#### Dealing with null values in data

In [ ]:
df = pd.DataFrame({'value1':[100,np.nan,234,np.nan],
                   'value2':[300,121,np.nan,np.nan],
                   'value3':['XUI','VYU','NMA','IUY']})
df.head()

   value1  value2 value3
0   100.0   300.0    XUI
1     NaN   121.0    VYU
2   234.0     NaN    NMA
3     NaN     NaN    IUY

In [ ]:
df.isnull()

   value1  value2  value3
0   False   False   False
1    True   False   False
2   False    True   False
3    True    True   False

In [ ]:
df.isna()

   value1  value2  value3
0   False   False   False
1    True   False   False
2   False    True   False
3    True    True   False

In [ ]:
df.isna().sum()

value1    2
value2    2
value3    0
dtype: int64

#### Filling null values with mean

In [ ]:
df.fillna(df.mean(),inplace=True)
df

   value1  value2 value3
0   100.0   300.0    XUI
1   167.0   121.0    VYU
2   234.0   210.5    NMA
3   167.0   210.5    IUY

#### Sorting

In [ ]:
df.sort_values(by='value2',ascending=True)

   value1  value2 value3
1   167.0   121.0    VYU
2   234.0   210.5    NMA
3   167.0   210.5    IUY
0   100.0   300.0    XUI

In [ ]:
data.sort_values(by='price',ascending=False).head()

     symboling  normalized_losses           make  ... city_mpg highway_mpg  price
71           1                140  mercedes-benz  ...       14          16  45400
15           0                149            bmw  ...       16          22  41315
70           0                140  mercedes-benz  ...       14          16  40960
125          3                128        porsche  ...       17          25  37028
16           0                149            bmw  ...       15          20  36880

[5 rows x 26 columns]

#### Group By and Count

In [ ]:
data['make'].value_counts()

toyota           32
nissan           18
mazda            17
honda            13
mitsubishi       13
subaru           12
volkswagen       12
peugot           11
volvo            11
dodge             9
bmw               8
mercedes-benz     8
plymouth          7
saab              6
audi              6
porsche           4
alfa-romero       3
chevrolet         3
jaguar            3
isuzu             2
renault           2
mercury           1
Name: make, dtype: int64

#### Concatenate dataframes

In [ ]:
mm = {'one':[2,3,1,4,5],
      'two':[5,4,3,2,1],
      'letter':['a','a','b','b','c']}
mm1 = pd.DataFrame(mm)
mm1

   one  two letter
0    2    5      a
1    3    4      a
2    1    3      b
3    4    2      b
4    5    1      c

In [ ]:
df

   value1  value2 value3
0   100.0   300.0    XUI
1   167.0   121.0    VYU
2   234.0   210.5    NMA
3   167.0   210.5    IUY

In [ ]:
new_df=pd.concat([df,mm1])
new_df

   value1  value2 value3  one  two letter
0   100.0   300.0    XUI  NaN  NaN    NaN
1   167.0   121.0    VYU  NaN  NaN    NaN
2   234.0   210.5    NMA  NaN  NaN    NaN
3   167.0   210.5    IUY  NaN  NaN    NaN
0     NaN     NaN    NaN  2.0  5.0      a
1     NaN     NaN    NaN  3.0  4.0      a
2     NaN     NaN    NaN  1.0  3.0      b
3     NaN     NaN    NaN  4.0  2.0      b
4     NaN     NaN    NaN  5.0  1.0      c

In [ ]:
new_df1=pd.concat([df,mm1],axis=1)
new_df1

   value1  value2 value3  one  two letter
0   100.0   300.0    XUI    2    5      a
1   167.0   121.0    VYU    3    4      a
2   234.0   210.5    NMA    1    3      b
3   167.0   210.5    IUY    4    2      b
4     NaN     NaN    NaN    5    1      c

#### Join and merge

In [4]:
sales = {
    'Jones':10000,
    'Chris':5000,
    'Piyush':440,
    'Meera':6700,
    'Rahul':300
}
region = {
    'Jones':'West',
    'Chris':np.nan,
    'Piyush':'West',
    'Meera':np.nan,
    'Anthony':'East',
    'Ellen':'South',
    'Josh': 'West',
    'Simran': 'East',
    'Oscar':'North'
}

In [5]:
sales_df = pd.DataFrame.from_dict(sales,orient='index',columns=['sales'])
sales_df

        sales
Jones   10000
Chris    5000
Piyush    440
Meera    6700
Rahul     300

In [6]:
region_df = pd.DataFrame.from_dict(region,orient='index',columns=['region'])
region_df

        region
Jones     West
Chris      NaN
Piyush    West
Meera      NaN
Anthony   East
Ellen    South
Josh      West
Simran    East
Oscar    North

#### Left Join

In [7]:
joined_df = region_df.join(sales_df,how='left')
joined_df

        region    sales
Jones     West  10000.0
Chris      NaN   5000.0
Piyush    West    440.0
Meera      NaN   6700.0
Anthony   East      NaN
Ellen    South      NaN
Josh      West      NaN
Simran    East      NaN
Oscar    North      NaN

#### Right Join

In [8]:
joined_df = region_df.join(sales_df,how='right')
joined_df

       region  sales
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700
Rahul     NaN    300

#### Inner Join

In [9]:
joined_df = region_df.join(sales_df,how='inner')
joined_df

       region  sales
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700

#### Outer Join

In [10]:
joined_df = region_df.join(sales_df,how='outer')
joined_df

        region    sales
Anthony   East      NaN
Chris      NaN   5000.0
Ellen    South      NaN
Jones     West  10000.0
Josh      West      NaN
Meera      NaN   6700.0
Oscar    North      NaN
Piyush    West    440.0
Rahul      NaN    300.0
Simran    East      NaN

In [11]:
region_df.index.name='names'
sales_df.index.name='names'

#### Merge

In [12]:
pd.merge(region_df,sales_df,on='names',how='left')

        region    sales
names
Jones     West  10000.0
Chris      NaN   5000.0
Piyush    West    440.0
Meera      NaN   6700.0
Anthony   East      NaN
Ellen    South      NaN
Josh      West      NaN
Simran    East      NaN
Oscar    North      NaN